package main

import (
	"fmt"
	"math/rand"
	"time"
)

const key = "Молли Мун грустно рассматривала свои розовые пятнистые лодыжки. Ноги стали крапчатыми, как колбасный фарш. И вода в ванне не виновата в этом. Они всегда были такими – бледными, тощими, с торчащими острыми коленками. Можно помечтать, что когда-нибудь эти ноги станут самыми красивыми на свете. Ведь превратился же гадкий утенок в прекрасного лебедя. Хотя надежды мало… Девочка откинулась на бортик ванны. Уши и кудрявые каштановые волосы погрузились в воду. На желтом, засиженном мухами потолке блеклой полоской мерцала лампа дневного света. В углу расползлась влажная клякса, обрамленная бахромой облупившейся краски. На пятне росла какая-то гадкая плесень. Вода налилась в уши, и все звуки теперь доносились будто сквозь густой туман. Мир уплыл далеко-далеко. Молли закрыла глаза. Обшарпанная ванная комната ветхого Хардвикского приюта исчезла. Девочка представила, что взлетает в воздух, будто птица. С высоты видит серую шиферную крышу в окружении заросшего ежевикой сада. Потом взмывает все выше и выше. Пологий склон холма, на котором стоит деревня Хардвик, раскидывается под ней, как крупномасштабная карта. Еще выше, пока убогое здание Хардвикского приюта не становится совсем крошечным! Все вверх и вверх! Вот уже весь город Брайерсвилль расстилается как на ладони. Еще выше! Вот разбегаются вдаль окрестные поля и леса. На горизонте показалось побережье, доносится плеск волн. Мысли девочки взлетели выше облаков. И вот Молли уже в космосе и оттуда смотрит на далекую Землю. Там она будет парить долго-долго. Молли любила представлять, что улетела с Земли. Это был ее способ отдыхать. И нередко, когда ей удавалось расслабиться, ее охватывало какое-то особенное чувство. Вот и сегодня на девочку нахлынуло это странное ощущение. Будто с ней вот-вот должно случиться что-то загадочное, удивительное. Когда такое чувство посетило Молли в прошлый раз, она нашла на тротуаре пакетик конфет. А в позапрошлый раз ей удалось вечером смотреть телевизор целых два часа вместо одного. И ей ничего за это не было! И какой же приятный сюрприз ждет ее сегодня? Она открыла глаза и снова очутилась в ванне. Вгляделась в свое лицо, вкривь и вкось отраженное нижней стороной хромированного крана. О боже! Неужели она такая уродливая?! Этот розоватый комок теста – ее лицо?! И эта картошка – ее нос?! А эти маленькие зеленые блестки – глаза?! Снизу донесся громкий стук. Будто молотком колотили по дереву. Странно. Вроде бы ничего не ремонтируют… И вдруг Молли поняла, что молоток тут ни при чем! Кто-то долбил в закрытую дверь ванной! Плохо дело. Девочка вскочила и здорово стукнулась головой о водопроводную трубу. Грохот становился все громче. К нему добавились разъяренные вопли: – Молли Мун, а ну открывай дверь! Сейчас же! А не то я ее сама открою своим универсальным ключом! Девочка услышала, как звякают ключи в связке. Она посмотрела в ванну и ахнула. Вода стояла намного выше, чем дозволялось правилами! Молли пулей выскочила из ванны. Вытащив сливную пробку, она потянулась за полотенцем. Еле успела! Дверь распахнулась. Мисс Гадкинс влетела в комнату и метнулась к ванне. Вода с бульканьем утекала в дырку. Обнаружив это, директриса кровожадно наморщила облупленный нос. Закатав рукав кримпленового платья, она сунула пробку на место. – Так я и думала, – прошипела она. – Преднамеренное нарушение правил приюта! Мисс Гадкинс злобно сверкнула глазами, достала из кармана рулетку и вытянула из коробочки длинную металлическую ленту. Причмокивая болтающейся во рту вставной челюстью, она измерила, насколько высоко стоит вода. Ее подозрения подтвердились! Уровень воды намного превышал красную линию, нарисованную вдоль бортика. Из щели между оконными створками тянуло ледяным сквозняком. От холода Молли стучала зубами. Несмотря на это, у девочки вспотели ладони. Они всегда потели у нее от волнения и страха. Мисс Гадкинс стряхнула рулетку и вытерла ее о рубашку Молли. Со звонким щелчком лента втянулась в коробочку. Молли собрала все силы и взглянула в лицо директрисе. Из-за коротко стриженных седых волос и обильной растительности на костлявом лице та больше напоминала мистера, чем мисс. – Ты наполнила ванну на тридцать сантиметров, – прошипела мисс Гадкинс. – К этому нужно добавить воду, утекшую в канализацию, пока я стучалась в дверь. Итого, высота воды в ванне была целых сорок сантиметров! Правила, как тебе хорошо известно, дозволяют наполнять ванну только на десять сантиметров. Ты превысила разрешенный уровень в четыре раза. Значит, использовала воду, предназначенную для четырех купаний. Следовательно, Молли Мун, тебе запрещается принимать ванну еще три недели! А в наказание… – Мисс Гадкинс схватила зубную щетку Молли."

//const key = "двое мишек плещутся в реке. ура! кричат обое. хм мишка говорит а правда что в реке вода?даправдаеслинеотлив.я"
const text = "Старый серый ослик Иа-Иа стоял один-одинёшенек в заросшем чертополохом уголке Леса, широко расставив передние ноги и свесив голову набок, и думал о Серьёзных Вещах. Иногда он грустно думал: «Почему?», а иногда: «По какой причине?», а иногда он думал даже так: «Какой из этого следует вывод?» И не удивительно, что порой он вообще переставал понимать, о чём же он, собственно, думает."

var buckets map[rune][]int
var encryptedText []int
var letPosition int
var parsedKey []rune

func main() {
	buckets := make(map[rune][]int)
	for _, char := range key {
		parsedKey = append(parsedKey, char)

	}
	for i, char := range parsedKey {
		buckets[char] = append(buckets[char], i)
	}
	for _, char := range text {
		rand.Seed(time.Now().UnixNano())
		if val, ok := buckets[char]; ok {
			letPosition = val[rand.Intn(len(buckets[char]))]
		} else {
			letPosition = buckets[32][rand.Intn(len(buckets[32]))]
		}
		encryptedText = append(encryptedText, letPosition)
	}
	fmt.Println(encryptedText)
}
