package main

import (
	"fmt"
	"strconv"
	"strings"
)

const key = "Молли Мун грустно рассматривала свои розовые пятнистые лодыжки. Ноги стали крапчатыми, как колбасный фарш. И вода в ванне не виновата в этом. Они всегда были такими – бледными, тощими, с торчащими острыми коленками. Можно помечтать, что когда-нибудь эти ноги станут самыми красивыми на свете. Ведь превратился же гадкий утенок в прекрасного лебедя. Хотя надежды мало… Девочка откинулась на бортик ванны. Уши и кудрявые каштановые волосы погрузились в воду. На желтом, засиженном мухами потолке блеклой полоской мерцала лампа дневного света. В углу расползлась влажная клякса, обрамленная бахромой облупившейся краски. На пятне росла какая-то гадкая плесень. Вода налилась в уши, и все звуки теперь доносились будто сквозь густой туман. Мир уплыл далеко-далеко. Молли закрыла глаза. Обшарпанная ванная комната ветхого Хардвикского приюта исчезла. Девочка представила, что взлетает в воздух, будто птица. С высоты видит серую шиферную крышу в окружении заросшего ежевикой сада. Потом взмывает все выше и выше. Пологий склон холма, на котором стоит деревня Хардвик, раскидывается под ней, как крупномасштабная карта. Еще выше, пока убогое здание Хардвикского приюта не становится совсем крошечным! Все вверх и вверх! Вот уже весь город Брайерсвилль расстилается как на ладони. Еще выше! Вот разбегаются вдаль окрестные поля и леса. На горизонте показалось побережье, доносится плеск волн. Мысли девочки взлетели выше облаков. И вот Молли уже в космосе и оттуда смотрит на далекую Землю. Там она будет парить долго-долго. Молли любила представлять, что улетела с Земли. Это был ее способ отдыхать. И нередко, когда ей удавалось расслабиться, ее охватывало какое-то особенное чувство. Вот и сегодня на девочку нахлынуло это странное ощущение. Будто с ней вот-вот должно случиться что-то загадочное, удивительное. Когда такое чувство посетило Молли в прошлый раз, она нашла на тротуаре пакетик конфет. А в позапрошлый раз ей удалось вечером смотреть телевизор целых два часа вместо одного. И ей ничего за это не было! И какой же приятный сюрприз ждет ее сегодня? Она открыла глаза и снова очутилась в ванне. Вгляделась в свое лицо, вкривь и вкось отраженное нижней стороной хромированного крана. О боже! Неужели она такая уродливая?! Этот розоватый комок теста – ее лицо?! И эта картошка – ее нос?! А эти маленькие зеленые блестки – глаза?! Снизу донесся громкий стук. Будто молотком колотили по дереву. Странно. Вроде бы ничего не ремонтируют… И вдруг Молли поняла, что молоток тут ни при чем! Кто-то долбил в закрытую дверь ванной! Плохо дело. Девочка вскочила и здорово стукнулась головой о водопроводную трубу. Грохот становился все громче. К нему добавились разъяренные вопли: – Молли Мун, а ну открывай дверь! Сейчас же! А не то я ее сама открою своим универсальным ключом! Девочка услышала, как звякают ключи в связке. Она посмотрела в ванну и ахнула. Вода стояла намного выше, чем дозволялось правилами! Молли пулей выскочила из ванны. Вытащив сливную пробку, она потянулась за полотенцем. Еле успела! Дверь распахнулась. Мисс Гадкинс влетела в комнату и метнулась к ванне. Вода с бульканьем утекала в дырку. Обнаружив это, директриса кровожадно наморщила облупленный нос. Закатав рукав кримпленового платья, она сунула пробку на место. – Так я и думала, – прошипела она. – Преднамеренное нарушение правил приюта! Мисс Гадкинс злобно сверкнула глазами, достала из кармана рулетку и вытянула из коробочки длинную металлическую ленту. Причмокивая болтающейся во рту вставной челюстью, она измерила, насколько высоко стоит вода. Ее подозрения подтвердились! Уровень воды намного превышал красную линию, нарисованную вдоль бортика. Из щели между оконными створками тянуло ледяным сквозняком. От холода Молли стучала зубами. Несмотря на это, у девочки вспотели ладони. Они всегда потели у нее от волнения и страха. Мисс Гадкинс стряхнула рулетку и вытерла ее о рубашку Молли. Со звонким щелчком лента втянулась в коробочку. Молли собрала все силы и взглянула в лицо директрисе. Из-за коротко стриженных седых волос и обильной растительности на костлявом лице та больше напоминала мистера, чем мисс. – Ты наполнила ванну на тридцать сантиметров, – прошипела мисс Гадкинс. – К этому нужно добавить воду, утекшую в канализацию, пока я стучалась в дверь. Итого, высота воды в ванне была целых сорок сантиметров! Правила, как тебе хорошо известно, дозволяют наполнять ванну только на десять сантиметров. Ты превысила разрешенный уровень в четыре раза. Значит, использовала воду, предназначенную для четырех купаний. Следовательно, Молли Мун, тебе запрещается принимать ванну еще три недели! А в наказание… – Мисс Гадкинс схватила зубную щетку Молли."

//const key = "двое мишек плещутся в реке. ура! кричат обое. хм мишка говорит а правда что в реке вода?даправдаеслинеотлив.я"
const text = "2335 1073 2081 3657 58 1612 938 4034 1665 1872 435 606 1438 4353 2858 2972 4609 1652 1322 4248 562 1753 4248 1267 3320 384 199 3534 3900 3 2556 3151 1534 26 4593 752 4104 3524 3768 3597 1685 2278 4087 2078 1747 3177 3125 2944 403 4215 562 3623 324 335 405 653 3057 4317 2544 2419 3152 3378 235 621 3158 341 2524 2531 592 1486 1299 2959 2327 2586 2328 3840 4298 429 1113 692 2345 2863 3209 4274 924 3437 2392 1847 1702 1677 2834 2955 4407 1196 2090 4335 900 3793 2749 2564 3855 4068 756 2408 4389 3249 15 3325 1281 2356 8 4455 2870 2749 236 676 1007 1966 449 288 3936 3442 3337 2547 1810 1509 4074 4048 995 2444 4141 3072 4233 1630 1395 3403 865 297 4573 2047 1494 4199 3192 1706 2652 2197 1125 63 3873 1597 4391 248 808 841 3145 4283 1707 678 1680 2391 192 4260 4284 734 2254 2267 475 2429 2103 3144 3833 533 1809 243 2608 1012 627 12 1765 3727 4272 1317 904 1301 4421 483 2238 3755 2674 319 4398 4305 3617 233 1082 3414 4176 2225 2022 1603 1544 1722 1968 2451 3731 1367 814 3406 1629 2674 3515 2558 1008 2613 3957 3967 634 332 4371 968 510 437 3277 4148 3402 193 3602 1121 2290 2587 2459 2894 3043 3068 2037 2970 2174 2420 1505 2187 2811 110 2455 3705 3323 3342 83 355 3000 2690 820 1108 2717 2312 2440 712 3001 507 2674 632 1299 2639 1345 3324 2351 1748 3362 4594 1401 3484 2269 3179 3197 544 2170 1685 2048 1619 1358 1795 2782 605 3707 1448 3680 98 2650 2161 1697 2264 2326 2056 2439 3907 2403 919 2209 3216 2514 1172 3198 174 4044 148 516 2707 4483 713 4338 1440 2923 264 2179 4533 222 3694 1246 3726 2701 1206 2470 4575 1468 2582 4223 1419 3860 2942 3780 4158 2954 2985 2593 1992 286 3826 788 1797 102 3418 3601 1353 3397 1139 1734 465 1869 4617 3619 4084 3785 1584 493 3887 3586 4070 4266 460 1599 1640 1509 3072 3737 1852 3012 713 390 1823 2358 2503 2344 3798 1338 1460 2124 1155 820 2572 803 4057 3838 3179 3237"

var buckets map[rune][]int
var encryptedText []string
var decryptedText []string
var parsedKey []rune

func main() {
	buckets := make(map[rune][]int)
	for _, char := range key {
		parsedKey = append(parsedKey, char)

	}
	for i, char := range parsedKey {
		buckets[char] = append(buckets[char], i)
	}
	encryptedText = strings.Split(text, " ")

	for _, v1 := range encryptedText {
		for i2, v2 := range buckets {
			for _, v3 := range v2 {
				v1int, err := strconv.Atoi(v1)
				if err != nil {
					fmt.Println("Error")
				}
				if int(v1int) == v3 {
					decryptedText = append(decryptedText, string(i2))
				}
			}
		}
	}
	for _, l := range decryptedText {
		fmt.Printf("%v", l)
	}
	fmt.Printf("\n")
}
